SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

CREATE TABLE `appartments` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `beds` int(11) NOT NULL,
  `img` varchar(255) NOT NULL,
  `price` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `appartments` (`id`, `title`, `description`, `beds`, `img`, `price`) VALUES
(11, 'Номер на одного', 'Свій пустився точках проектах попереджав останній маленький там зустрів піднявшись до диких рекламних яке своє, семантика незабаром пропозиції вирішила раз підступний це, провулка міста країну далеко назад великий.', 1, '40476572.jpg', 35),
(12, 'Номер на двох', 'Свій пустився точках проектах попереджав останній маленький там зустрів піднявшись до диких рекламних яке своє, семантика незабаром пропозиції вирішила раз підступний це, провулка міста країну далеко назад великий.', 2, '-47952560.jpg', 55),
(13, 'На велику компанію ',' Свій пустився точках проектах попереджав останній маленький там зустрів піднявшись до диких рекламних яке своє, семантика незабаром пропозиції вирішила раз підступний це, провулка міста країну далеко назад великий.', 3, '660865024.jpg', 100),
(14, 'Спеціальна пропозиція ',' Свій пустився точках проектах попереджав останній маленький там зустрів піднявшись до диких рекламних яке своє, семантика незабаром пропозиції вирішила раз підступний це, провулка міста країну далеко назад великий.', 2, '655582228.jpg', 50);

ALTER TABLE `appartments`
  ADD PRIMARY KEY (`id`);

ALTER TABLE `appartments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
