//+
x = +'12'; // 12

//parseInt() Метод перетворює рядок у ціле число (ціле число).
//Перший аргумент - це рядок для перетворення.
//Другий Це базове число, яке використовується в математичних системах.
var text = '42px';
var integer = parseInt(text, 10);
// returns 42
var integer = parseInt(11110111, 2);
// returns 42



//parseFloat() Метод перетворює рядок в число з десятковою крапкою.
var text = '3.14someRandomStuff';
var pointNum = parseFloat(text);
// returns 3.14




//Number() Метод перетворює рядок в число.
//Іноді це ціле число. В іншому випадку це крапка.
//І якщо ви передасте рядок із випадковим текстом, ви отримаєте NaN абревіатуру "Не число".
//Внаслідок цієї невідповідності вибір є менш безпечним, ніж parseInt()та parseFloat().
//Якщо ви хочете, щоб у рядку не виходило, NaNякщо в ньому є інші символи,
//це Number()може бути кращим вибором.
Number('123'); // returns 123
Number('12.3'); // returns 12.3
Number('3.14someRandomStuff'); // returns NaN
Number('42px'); // returns NaN
