rogerShots(["Bang!", "Bang!", "Bang!", "Bang!", "Bang!", "Bang!"]);// ➞ 3
rogerShots(["Bang!", "Bang!", "Bang!", "Bang!", "BangBang!"]);// ➞ 2.5
rogerShots(["Bang!", "BangBangBang!", "Boom!", "Bang!", "BangBang!", "BangBang!"]);// ➞ 2
// Дикому Роджеру доручено збити 6 пляшок з 6 пострілами якомога швидше.
// Ось різні типи знімків, які він міг зробити:
// Він міг за допомогою одного пістолета вистрілити з пляшки за "Bang!"0,5 секунди.
// Або він міг використати обидва пістолети одночасно, "BangBang!"щоб вистрілити
// дві пляшки за 0,5 секунди.
// Враховуючи масив струн, поверніть час (у секундах), який знадобився,
// щоб збити всі 6 пляшок. Обов’язково рахуйте лише Бангс і Бангбанг.
// Нічого іншого не рахується.
// Усі пляшки будуть збиті у всіх тестах.

// Здійснюйте глобальний, нечутливий до регістру пошук "це", а не "усі":
// var str = "Is this all there is";
// var patt1 = /is(?! all)/gi;



const rogerShots = arr => {
	return arr.filter(v => /^(Bang){1,2}!/.test(v)).length / 2;
}




function rogerShots(arr) {
	return arr.filter(x => x == "Bang!" || x == "BangBang!").length/2
}
