.........може перетворити числа в рядки.
String(100 + 23);
(123).toString();
..
Number()          може конвертувати рядки в числа.
parseFloat ()     Розбирає рядок і повертає число з плаваючою точкою
parseInt ()        Розбирає рядок і повертає ціле число
toExponential ()      Повертає рядок з числом, округленим і записаним, використовуючи експоненціальні позначення.
toFixed ()            Повертає рядок із числом, округленим і записаним із заданою кількістю десяткових знаків.
toPrecision ()        Повертає рядок із номером, записаним із заданою довжиною

........округлює число до двох знаків після коми
let x = 9.656;
 x.toFixed(2)

 ..............шукає max в списку
 var x = Math.max(0, 150, 30, 20, -8, -200);
