// https://reactgo.com/react-environment-variables/
// Змінні середовища допомагають нам використовувати різні конфігурації в нашому додатку 
// для реагування, наприклад, ми можемо використовувати різні API для розробки та різні для 
// виробництва, не змінюючи кожного разу весь додаток або приховуючи функцію, 
// яка ще не готова до виробництва.


// 1.  Щоб визначити змінні середовища, спочатку нам потрібно створити файл .env файлу 
// в кореневій папці нашого додатка для реагування.
// Тепер ми можемо визначити змінні середовища всередині цього файлу за допомогою 
// REACT_APP_.VARIABLE_NAME=VALUE.
// ./.env
REACT_APP_.BASE_URL=https://google.com

// 2. ми можемо отримати доступ до змінних середовища за допомогою process.env.REACT_APP_.BASE_URL
// ./App.js
import React from "react";

export default function App(){
   return (
      <div>
        <a href={process.REACT_APP_.BASE_URL}>My app</a>
      </div>
   )
}

// 22.  Усередині public/index.html файлу ми можемо отримати доступ до таких змінних середовища.
// ./index.html
<base href="%REACT_APP_BASE_URL%">