// Передайте вбудовану функцію зворотнього виклику і масив залежностей. useCallback поверне мемоізовану 
// версію функції зворотнього виклику, котра змінюється лише тоді, коли одна з її залежностей змінюється. 
// Це корисно при передачі фукцій зворотнього виклику до оптимізоваих дочірніх компонентів, що покладаються 
// на рівність посилань задля уникнення непотрібних рендерів (наприклад, shouldComponentUpdate).

// useCallback(fn, deps) є еквівалентом useMemo(() => fn, deps).

const memoizedCallback = useCallback(
  () => {
    doSomething(a, b);
  },
  [a, b],
);