// Унікальні елементи масиву
// внаслідок здатності Array.from() приймати ітерабельні об'єкти - це швидко видалити дублікати з масиву.
// Він досягається в поєднанні зі Setструктурою даних:

function unique(array) {
  return Array.from(new Set(array));
}

unique([1, 1, 2, 3, 3]); // => [1, 2, 3]



// Спочатку new Set(array)створюється набір, що містить елементи масиву.
// Внутрішньо набір видаляє дублікати.
// Оскільки набір є ітерабельним, Array.from()
// витягує унікальні елементи в новий масив.
